InformationRegisters/КартинкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыДляКартинок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КартинкиОбъектов/Forms/ФормаУдалитьКартинку/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектТЗ", 			ОбъектТЗ);
	Параметры.Свойство("НомерПоПорядку", 	НомерПоПорядку);
	
	Если ЗначениеЗаполнено(ОбъектТЗ) Тогда
		Элементы.ОбъектТЗ.Заголовок = ОбъектТЗ.Метаданные().Представление();
		
		омКартинкиНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКартинки, , Истина);
		
	Иначе
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	омКартинкиНаКлиенте.ВывестиКартинку(ОбъектТЗ, НомерПоПорядку, ЭтаФорма, 1);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьНаСервере(ОбъектТЗ, НомерПоПорядку)           
	
	МенеджерЗаписи = РегистрыСведений.КартинкиОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектТЗ 		= ОбъектТЗ;
	МенеджерЗаписи.НомерПоПорядку 	= НомерПоПорядку;
	
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	УдалитьНаСервере(ОбъектТЗ, НомерПоПорядку);
	Оповестить("ИзменилииКартинкиОбъектТЗ", Новый Структура("ОбъектТЗ", ОбъектТЗ));
	Закрыть();
	
КонецПроцедуры
